In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\kaustubh hande\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\kaustubh hande\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\kaustubh hande\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\kaustubh hande\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\kaustubh hande\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\kaustubh hande\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [2]:
import pandas as pd

In [6]:
#series : it is a class which should be in capital 
from pandas import Series,DataFrame
obj_1= pd.Series([4,2,3,4,5])#bydefault it takes index from 0 
obj_1

0    4
1    2
2    3
3    4
4    5
dtype: int64

In [8]:
#if we want months at bydefault index
obj_1= pd.Series([4,2,3,4,5],index=['april','may','june','july','august'])
obj_1

april     4
may       2
june      3
july      4
august    5
dtype: int64

In [12]:
#this are the atributes which doesnot need the'()' brackets
obj_1.values

array([4, 2, 3, 4, 5], dtype=int64)

In [13]:
#this are the atributes which doesnot need the'()' brackets
obj_1.index

Index(['april', 'may', 'june', 'july', 'august'], dtype='object')

In [17]:
#for checking the index value 
obj_1['april'] #indexing should call in '[]' brackets

4

In [22]:
#we can update the index value
obj_1['april']=5
obj_1

april     5
may       2
june      3
july      4
august    5
dtype: int64

In [23]:
#it is a condition to filter out 
print(obj_1[obj_1 >=4])

april     5
july      4
august    5
dtype: int64

In [24]:
a=pd.Series([20,30,40,50,60],index=['kaustubh','sahil','jay','prajwal','sujit'])

In [25]:
a

kaustubh    20
sahil       30
jay         40
prajwal     50
sujit       60
dtype: int64

In [26]:
a.index

Index(['kaustubh', 'sahil', 'jay', 'prajwal', 'sujit'], dtype='object')

In [27]:
a.values

array([20, 30, 40, 50, 60], dtype=int64)

In [29]:
a['sahil']

30

In [30]:
print(a[a<=40])

kaustubh    20
sahil       30
jay         40
dtype: int64

In [31]:
#it multiply the values of the given
obj_2=a*0.20
obj_2

kaustubh     4.0
sahil        6.0
jay          8.0
prajwal     10.0
sujit       12.0
dtype: float64

In [32]:
import numpy as np

In [34]:
# e mostly used for exponent and log
obj_3=np.exp(obj_2)
obj_3

kaustubh        54.598150
sahil          403.428793
jay           2980.957987
prajwal      22026.465795
sujit       162754.791419
dtype: float64

In [36]:
#checks the index of series 
'jan' in obj_1

False

In [38]:
#checks the value of series
5 in obj_1.values

True

### Connection between Dictionaries and Series in pandas

In [39]:
dict_1={'A':50,'B':70,'C':80,'D':100,'E':67}

In [40]:
obj_4 = pd.Series(dict_1)
obj_4

A     50
B     70
C     80
D    100
E     67
dtype: int64

In [43]:
#for changing the indexing of series
index_name=[1,2,3,4,5]
obj_4.index=index_name
obj_4

1     50
2     70
3     80
4    100
5     67
dtype: int64

In [44]:
#if we want to replace the original value of index
index_name2=['B','C','D','A']
obj_5=pd.Series(dict_1, index =index_name2)
obj_5

B     70
C     80
D    100
A     50
dtype: int64

In [47]:
#for checking the series is null or not ; null is denoted by 'NAN'
pd.isnull(obj_5)=

B    False
C    False
D    False
A    False
dtype: bool

In [48]:
pd.notnull(obj_5)

B    True
C    True
D    True
A    True
dtype: bool

In [49]:
obj_4

B     50
C     70
D     80
E    100
F     67
dtype: int64

In [50]:
obj_5=obj_4
obj_5.index=['A','B','C','D','E']
obj_5

A     50
B     70
C     80
D    100
E     67
dtype: int64

In [51]:
#add the value of the series
obj_9=obj_4+obj_5
obj_9

A    100
B    140
C    160
D    200
E    134
dtype: int64

In [53]:
#bydefault it takes 1st five values
obj_9.head()

A    100
B    140
C    160
D    200
E    134
dtype: int64

In [54]:
obj_9.head(2)

A    100
B    140
dtype: int64

In [56]:
obj_9.tail(2)

D    200
E    134
dtype: int64

In [58]:
obj_4.index.name="Student Name"
obj_4.name="marks"
obj_4

Student Name
A     50
B     70
C     80
D    100
E     67
Name: marks, dtype: int64

In [61]:
student_name= pd.Series(['Ana','Eve','Chris','Della','Anne'])
student_name_filter=student_name[student_name.str.startswith("A")]
student_name_filter

0     Ana
4    Anne
dtype: object

### Reindexing

In [2]:
import pandas as pd
import numpy as np

In [3]:
series=pd.Series([10,20,30,40],index=['a','b','c','d'])
series

a    10
b    20
c    30
d    40
dtype: int64

In [4]:
#reindex : used to shuffling the row & by defult it fills null value
'''
if we will take another index which  is not a part of index 
then it will show null value and data type will be flot bydefualt
'''
series_1=series.reindex( index=['d','c','a','b'])
series_1

d    40
c    30
a    10
b    20
dtype: int64

In [5]:
series_2=pd.Series([10,20,30,40],index=[0,3,9,12])
series_2

0     10
3     20
9     30
12    40
dtype: int64

In [6]:
#reindex in range is return no.of range upto index 13 & return value which is given otherwise it will return null value 
series_3=series_2.reindex(range(13))
series_3

0     10.0
1      NaN
2      NaN
3     20.0
4      NaN
5      NaN
6      NaN
7      NaN
8      NaN
9     30.0
10     NaN
11     NaN
12    40.0
dtype: float64

In [7]:
#reindex: it is having method for filling the null value.
'''
ffill:-forward filling
bfill:- backward filling
'''
series_4=series_2.reindex(range(13),method='ffill')
series_4 #forward filling

0     10
1     10
2     10
3     20
4     20
5     20
6     20
7     20
8     20
9     30
10    30
11    30
12    40
dtype: int64

In [8]:
series_4=series_2.reindex(range(13),method='bfill')
series_4 #backward filling

0     10
1     20
2     20
3     20
4     30
5     30
6     30
7     30
8     30
9     30
10    40
11    40
12    40
dtype: int64

### when numpy and pandas work togheter

In [24]:
df=pd.DataFrame(np.arange(16).reshape((4,4)),index=['ohio','colorado','utah','New York'],columns=['one','two','three','four'])
df

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
New York   12   13     14    15

In [25]:
df['two']

ohio         1
colorado     5
utah         9
New York    13
Name: two, dtype: int32

In [26]:
df[['two','three']]

          two  three
ohio        1      2
colorado    5      6
utah        9     10
New York   13     14

In [27]:
#when you have to call both row and column then :-
df['two']['ohio']

1

In [28]:
a=df[:2]
a

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7

In [29]:
df

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
New York   12   13     14    15

In [31]:
df[df['four']<11]

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7

In [32]:
df<11

            one    two  three   four
ohio       True   True   True   True
colorado   True   True   True   True
utah       True   True   True  False
New York  False  False  False  False

### add two data frame

In [40]:
df1=pd.DataFrame(np.arange(12).reshape((4,3)),index=['ohio','colorado','utah','New York'],columns=['one','two','three'])
print(df1)
print(df)

          one  two  three
ohio        0    1      2
colorado    3    4      5
utah        6    7      8
New York    9   10     11
          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
New York   12   13     14    15

In [49]:
df2=df1+df
df2

          four  one  three  two
ohio       NaN    0      4    2
colorado   NaN    7     11    9
utah       NaN   14     18   16
New York   NaN   21     25   23

In [45]:
df5=df.add(df1,fill_value=0)
df5

          four  one  three  two
ohio       3.0    0      4    2
colorado   7.0    7     11    9
utah      11.0   14     18   16
New York  15.0   21     25   23

In [47]:
f=lambda x:x**2
df.apply(f)

          one  two  three  four
ohio        0    1      4     9
colorado   16   25     36    49
utah       64   81    100   121
New York  144  169    196   225

In [51]:
f=lambda x:x.max()-x.min()
df.apply(f)

one      12
two      12
three    12
four     12
dtype: int64

In [55]:
def f(x):
    return pd,series([x.min(),x.max()],index=['min','max'])
df1.apply (minmax)

NameError: name 'minmax' is not defined

In [58]:
series_1=pd.Series([1,2,3,4,5],index=['d','b','c','e','f'])
sorted_series=series_1.sort_index()
sorted_series_1 = series_1.sort_values()
sorted_series_1 # by defualt sorting is done in the ascending order

d    1
b    2
c    3
e    4
f    5
dtype: int64

In [62]:
series_1=pd.Series([1,2,3,4,5],index=['d','b','c','e','f'])
sorted_series=series_1.sort_index(ascending = False)
sorted_series_1 = series_1.sort_values()
sorted_series_1

d    1
b    2
c    3
e    4
f    5
dtype: int64

In [63]:
df1=pd.DataFrame({'key':['k0','k1','k2'],'A':['A0','A1','A2']})